app/views/articles/index.html.slim

SELECT `for_num_articles`.* FROM `for_num_articles` WHERE `for_num_articles`.`for_num_name_id` = 1 ORDER BY created_at DESC
---
li = link_to "I want to create a new one", new_article_path(for_num_name_id: @for_num_name.id)
- @for_num_name.for_num_articles.each do |for_num_article|