app/views/articles/index.html.slim

SELECT `articles`.* FROM `articles` WHERE `articles`.`topic_id` = 7 ORDER BY created_at DESC
---
  ol.articles-ol
    - @topic.articles.each do |article|