app/controllers/articles_controller.rb

UPDATE `articles` SET `like` = 1, `updated_at` = '2013-11-01 08:42:20' WHERE `articles`.`id` = 2
---
  def like
    @article = Article.find(params[:id])
    @article.update(like: @article.like+1)