app/controllers/articles_controller.rb

  def index
    @topic = Topic.find(params[:topic_id])
    @articles = Article.where(:topic_id => params[:topic_id]).paginate(:page => params[:page], :per_page => 9).order('"like" DESC')
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 7 LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`topic_id` = 7 ORDER BY created_at DESC

  def show
    @article = Article.find(params[:id])
    @comments = Comment.where(:article_id => params[:id]).paginate(:page => params[:page], :per_page => 9).order('created_at DESC')
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 1 ORDER BY created_at DESC

  def create
    @topic = Topic.find(params[:topic_id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 8 ORDER BY `topics`.`id` ASC LIMIT 1

  def like
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 0 LIMIT 1