app/controllers/articles_controller.rb

SELECT `for_num_names`.* FROM `for_num_names` WHERE `for_num_names`.`id` IS NULL LIMIT 1
---
  def index
    @for_num_name = ForNumName.find_by(id: params[:for_num_name_id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 ORDER BY `articles`.`id` ASC LIMIT 1
SELECT `for_num_articles`.* FROM `for_num_articles` WHERE `for_num_articles`.`id` = 6 LIMIT 1
---
  def show
    @for_num_article = ForNumArticle.find_by(id: params[:id])

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `for_num_articles`.* FROM `for_num_articles` WHERE `for_num_articles`.`id` = 6 LIMIT 1
---
  def edit
    @for_num_article = ForNumArticle.find_by(id: params[:id])

INSERT INTO `articles` (`created_at`, `detail`, `title`, `topic_id`, `updated_at`, `user_id`) VALUES ('2013-11-01 01:54:32', 'This is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!\r\nThis is the content!!!!', 'Lodarki\'s Second Article', 8, '2013-11-01 01:54:32', 1)
INSERT INTO `for_num_articles` (`created_at`, `detail`, `permission`, `title`, `updated_at`, `user_id`) VALUES ('2013-10-31 13:33:35', 'this is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!\r\nthis is the content!!', 2, 'The first article', '2013-10-31 13:33:35', 1)
---
  def create
    @for_num_article = ForNumArticle.new(params[:for_num_article].permit(:for_num_name_id,:title, :detail, :permission))
    @for_num_article.user_id = current_user.id
    @for_num_article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `for_num_articles`.* FROM `for_num_articles` WHERE `for_num_articles`.`id` = 6 LIMIT 1
UPDATE `articles` SET `detail` = 'This is Content!!1111111111111111111\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!\r\nThis is Content!!', `updated_at` = '2013-11-01 01:05:51' WHERE `articles`.`id` = 1
UPDATE `for_num_articles` SET `title` = 'This is the first ariticle', `detail` = 'This is the content!!\r\nThis is the content!!\r\nThis is the content!!\r\nThis is the content!!This is the content!!\r\nThis is the content!!\r\nThis is the content!!\r\nThis is the content!!This is the content!!\r\nThis is the content!!\r\nThis is the content!!\r\nThis is the content!!This is the content!!\r\nThis is the content!!\r\nThis is the content!!\r\nThis is the content!!', `updated_at` = '2013-10-31 14:39:58' WHERE `for_num_articles`.`id` = 6
---
  def update
    @for_num_article = ForNumArticle.find_by(id: params[:id])
    @for_num_article.update(params[:for_num_article].permit(:for_num_name_id,:title, :detail, :permission))