app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(params[:comment].permit(:article_id, :detail).merge(:user_id => current_user.id))
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`article_id`, `created_at`, `detail`, `updated_at`, `user_id`) VALUES (1, '2013-11-01 06:51:37', 'I like this article!!', '2013-11-01 06:51:37', 2)

  def destroy
    @article = Article.find(params[:article_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3