app/controllers/home_controller.rb

SELECT `topics`.* FROM `topics`
---
	def index
    @topics = Topic.all