app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT `topics`.* FROM `topics`

  def edit
    @topic = Topic.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 11 LIMIT 1

  def show
    @topic = Topic.find(params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 11 LIMIT 1

  def create
    @topic = Topic.new topic_name
    @topic.save
---
INSERT INTO `topics` (`name`) VALUES ('dafdf')

  def update
    @topic = Topic.find(params[:id])
    @topic.update topic_name
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 6 LIMIT 1
UPDATE `topics` SET `name` = 'dafdf1' WHERE `topics`.`id` = 6

  def destroy
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 11 LIMIT 1
DELETE FROM `topics` WHERE `topics`.`id` = 11