app/controllers/topics_controller.rb

SELECT `for_num_names`.* FROM `for_num_names`
---
  def index
    @for_num_names = ForNumName.all